app/Controllers/FormController.php

    public function index_own()
    {
        // get their own forms
        $session = \Config\Services::session();
        $user_id = $session->get("usua_ide");

        $form_model = new Form;

        $forms = $form_model->where("user_id", $user_id)->where("state_id", 1)->orderBy("created_at", "desc")->findAll();
---
SELECT *
FROM `forms`
WHERE `user_id` = '1'
AND `state_id` = 1
ORDER BY `created_at` DESC

    public function config_items($form_id)
    {
        $aspect_model = new Aspect;
        $item_model = new Item;
        $alternative_model = new Alternative;

        // get aspects
        $aspects = $aspect_model->where("form_id", $form_id)->where("state_id", 1)->orderBy("order", "asc")->findAll();

        // get items of each aspect
        foreach($aspects as $aspect)
        {
            $aspect_id = $aspect->id;
            $items = $item_model->where("aspect_id", $aspect_id)->where("state_id", 1)->orderBy("order", "asc")->findAll();

            // get alternatives of each item
            foreach($items as $item)
            {
                if($item->item_type_id == 3 || $item->item_type_id == 4)
                {
                    $item_id = $item->id;
                    $alternatives = $alternative_model->where("item_id", $item_id)->where("state_id", 1)->orderBy("order", "asc")->findAll();
---
SELECT *
FROM `aspects`
WHERE `form_id` = '3'
AND `state_id` = 1
ORDER BY `order` ASC
SELECT *
FROM `items`
WHERE `aspect_id` = '21'
AND `state_id` = 1
ORDER BY `order` ASC
SELECT *
FROM `alternatives`
WHERE `item_id` = '2'
AND `state_id` = 1
ORDER BY `order` ASC