app/Controllers/ItemController.php

    public function update_items_order()
    {
        $items_ids = $this->request->getPost('items_ids');
        $item_model = new Item;

        $data = [];
        foreach ($items_ids as $index => $item_id)
        {
            $data[] = [
                'id' => $item_id,
                'order' => $index + 1 // Reemplaza 'campo_a_actualizar' con el nombre del campo que deseas actualizar
            ];
        }

        $records_were_updated = $this->db->table('items')->updateBatch($data, 'id');
---
UPDATE `items` SET `order` = CASE 
WHEN `id` = '49' THEN 1
WHEN `id` = '40' THEN 2
WHEN `id` = '48' THEN 3
ELSE `order` END
WHERE `id` IN('49','40','48')